Reports/СравнительныйАнализЗатратНаПерсонал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>СравнительныйАнализЗатратНаПерсонал</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РасширеннаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтрицательноеКрасным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьБыстрыйОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимФормированияОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сценарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сценарий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазваниеКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсВалютыРегУчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсВалютыУпрУчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВалютыРегУчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВалютыУпрУчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДанныхДляПланФактногоАнализаЗатратНаПерсонал</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭталонСценарий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭталонНачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭталонКонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаНачалоПериода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаКонецПериода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Enums/ВидыДанныхДляПланФактногоАнализаЗатратНаПерсонал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДанныхДляПланФактногоАнализаЗатратНаПерсонал</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сценарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФактическиеДанные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/СравнительныйАнализЗатратНаПерсонал/Ext/ObjectModule.bsl
Перем СохраненнаяНастройка Экспорт;
Перем Расшифровки Экспорт;
Перем ЭлементОтбора Экспорт;

#Если Клиент ИЛИ ВнешнееСоединение Тогда

Функция СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина) Экспорт
		
	ЭталоныйСценарий = "";
	НачалоПериода    = '00010101';
	КонецПериода     = '00010101';
	
	Если Сценарии.Количество() > 0 Тогда
		ЭталоныйСценарий = Сценарии[0].Сценарий;
		НачалоПериода    = Сценарии[0].НачалоПериода;
		КонецПериода     = Сценарии[0].КонецПериода;
		
		ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНачала"));
		ЗначениеПараметра.Значение = НачалоПериода;
		
		ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаКонца"));
		ЗначениеПараметра.Значение = КонецПериода;
		
		ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Сценарий"));
		ЗначениеПараметра.Значение = ЭталоныйСценарий;
		
		ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВалютаУпрУчета"));
		ЗначениеПараметра.Значение = Константы.ВалютаУправленческогоУчета.Получить();
		
		ИспользоватьУправленческийУчетЗарплаты = глЗначениеПеременной("глИспользоватьУправленческийУчет");
		Если НЕ ИспользоватьУправленческийУчетЗарплаты Тогда
			ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "Учет", Ложь);
		КонецЕсли;
		//ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВалютаРеглУчета"));
		//ЗначениеПараметра.Значение = Константы.ВалютаРегламентированногоУчета.Получить();
		
	КонецЕсли;
	
	// Создадим и инициализируем процессор компоновки
	
	Для Каждого СтрокаТаблицыСценария Из Сценарии Цикл
		
		СтрокаТаблицыСценария.ЭталонСценарий      = ЭталоныйСценарий;
		СтрокаТаблицыСценария.ЭталонНачалоПериода = НачалоПериода;
		СтрокаТаблицыСценария.ЭталонКонецПериода  = КонецПериода;
		
		СтруктураРесурсов = ОбщегоНазначения.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), СтрокаТаблицыСценария.НачалоПериода);
		СтрокаТаблицыСценария.КурсВалютыРегУчета      = СтруктураРесурсов.Курс;
		СтрокаТаблицыСценария.КратностьВалютыРегУчета = СтруктураРесурсов.Кратность;
	
		СтруктураРесурсов = ОбщегоНазначения.ПолучитьКурсВалюты(Константы.ВалютаУправленческогоУчета.Получить(), СтрокаТаблицыСценария.НачалоПериода);
		СтрокаТаблицыСценария.КурсВалютыУпрУчета      = СтруктураРесурсов.Курс;
		СтрокаТаблицыСценария.КратностьВалютыУпрУчета = СтруктураРесурсов.Кратность;
		
		// перепишем заголовок во всех строках
		Номер        = СтрокаТаблицыСценария.НомерСтроки;
		СтрокаПериод = "Период : " + ПредставлениеПериода(СтрокаТаблицыСценария.НачалоПериода, СтрокаТаблицыСценария.КонецПериода);
		Если СтрокаТаблицыСценария.Сценарий = Справочники.СценарииПланирования.ПустаяСсылка() Тогда
			
			СтрокаТаблицыСценария.НазваниеКолонки = ?(Номер = 1,"Эталонный период.","Сравниваемый период " + Номер + ".")
			+ Символы.ПС + "Фактические данные." + " Нет периода." + Символы.ПС + СтрокаПериод;
			
		Иначе
			
			ПериодДанных = СтрокаТаблицыСценария.Сценарий.Периодичность;
			СтрокаТаблицыСценария.НазваниеКолонки = ?(Номер = 1,"Эталонный период.","Сравниваемый период " + Номер + ".")
			+ Символы.ПС + СтрокаТаблицыСценария.Сценарий + " " + ПериодДанных + "." + Символы.ПС+СтрокаПериод;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВнешниеНаборыДанных = Новый Структура("ТаблицаСценариев", Сценарии);
	
	Возврат ТиповыеОтчеты.СформироватьТиповойОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, ВнешниеНаборыДанных);
	
	//Возврат ТиповыеОтчеты.СформироватьТиповойОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета);
	
КонецФункции

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ДоработатьКомпоновщикПередВыводом() Экспорт
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Если ЗначениеПараметра = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеПараметра.Значение = '00010101' Тогда
		ЗначениеПараметра.Значение = КонецДня(ТекущаяДата());
		ЗначениеПараметра.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

#Если Клиент Тогда
	
// Для настройки отчета (расшифровка и др.)
Процедура Настроить(Отбор, КомпоновщикНастроекОсновногоОтчета = Неопределено) Экспорт
	
	ТиповыеОтчеты.НастроитьТиповойОтчет(ЭтотОбъект, Отбор, КомпоновщикНастроекОсновногоОтчета);
	
КонецПроцедуры

Процедура СохранитьНастройку() Экспорт
	
	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	//СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
	
КонецПроцедуры

// Процедура заполняет параметры отчета по элементу справочника из переменной СохраненнаяНастройка.
Процедура ПрименитьНастройку() Экспорт
	
	Если СохраненнаяНастройка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	 
	СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
	ТиповыеОтчеты.ПрименитьСтруктуруПараметровОтчета(ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры

Процедура ИнициализацияОтчета() Экспорт
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	
	Если ЗначениеПараметра <> Неопределено И ЗначениеПараметра.Значение = '00010101' Тогда
		
		ЗначениеПараметра.Значение = НачалоМесяца(ОбщегоНазначения.ПолучитьРабочуюДату());
		
	КонецЕсли;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	
	Если ЗначениеПараметра <> Неопределено И ЗначениеПараметра.Значение = '00010101' Тогда
		
		ЗначениеПараметра.Значение = КонецМесяца(ОбщегоНазначения.ПолучитьРабочуюДату());
		
	КонецЕсли;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	Если ЗначениеПараметра <> Неопределено И ЗначениеПараметра.Значение = '00010101' Тогда
		
		ЗначениеПараметра.Значение = КонецМесяца(ОбщегоНазначения.ПолучитьРабочуюДату());
		
	КонецЕсли;
	
	Если Сценарии.Количество() = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СценарииПланирования.Ссылка
		|ИЗ
		|	Справочник.СценарииПланирования КАК СценарииПланирования
		|
		|УПОРЯДОЧИТЬ ПО
		|	СценарииПланирования.Периодичность.Порядок УБЫВ";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Сценарий = Выборка.Ссылка;
		
			НоваяСтрока                     = Сценарии.Добавить();
			НоваяСтрока.ВидДанных	        = Перечисления.ВидыДанныхДляПланФактногоАнализаЗатратНаПерсонал.Сценарий;
			НоваяСтрока.Сценарий	        = Сценарий;
			НоваяСтрока.НачалоПериода       = ОбщегоНазначения.ДатаНачалаПериода(ОбщегоНазначения.ПолучитьРабочуюДату(), Сценарий.Периодичность);
			НоваяСтрока.КонецПериода        = КонецДня(ОбщегоНазначения.ДатаКонцаПериода(ОбщегоНазначения.ПолучитьРабочуюДату(), Сценарий.Периодичность));
			НоваяСтрока.СтрокаНачалоПериода = ОбщегоНазначения.ПолучитьПериодСтрокой(НоваяСтрока.НачалоПериода, ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Сценарий.Периодичность));
			НоваяСтрока.СтрокаКонецПериода  = ОбщегоНазначения.ПолучитьПериодСтрокой(НоваяСтрока.КонецПериода, ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Сценарий.Периодичность));
			
			НоваяСтрока               = Сценарии.Добавить();
			НоваяСтрока.ВидДанных	  = Перечисления.ВидыДанныхДляПланФактногоАнализаЗатратНаПерсонал.ФактическиеДанные;
			НоваяСтрока.НачалоПериода = ОбщегоНазначения.ДатаНачалаПериода(ОбщегоНазначения.ПолучитьРабочуюДату(), Сценарий.Периодичность);
			НоваяСтрока.КонецПериода  = КонецДня(ОбщегоНазначения.ДатаКонцаПериода(ОбщегоНазначения.ПолучитьРабочуюДату(), Сценарий.Периодичность));
			НоваяСтрока.СтрокаНачалоПериода = ОбщегоНазначения.ПолучитьПериодСтрокой(НоваяСтрока.НачалоПериода, ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Сценарий.Периодичность));
			НоваяСтрока.СтрокаКонецПериода  = ОбщегоНазначения.ПолучитьПериодСтрокой(НоваяСтрока.КонецПериода, ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Сценарий.Периодичность));
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭлементОтбораПодразделения = Неопределено;
	Для Каждого ЭлементОтб Из  КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтб) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементОтб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Учет") тогда
			ЭлементОтбора = ЭлементОтб;
		КонецЕсли;
		Если ТипЗнч(ЭлементОтб) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементОтб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение") тогда
			ЭлементОтбораПодразделения = ЭлементОтб;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить("ЭлементОтбораКомпоновкиДанных");
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Учет");
	КонецЕсли;
	
	Если РежимФормированияОтчета = "ПоЦентрамОтветственности" Тогда
		ЭлементОтбора.ПравоеЗначение = Истина;
		Если ЭлементОтбораПодразделения <> Неопределено Тогда
			ЭлементОтбораПодразделения.ПравоеЗначение = Справочники.Подразделения.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли РежимФормированияОтчета = "ПоОрганизационнойСтруктуреПредприятия" Тогда
		ЭлементОтбора.ПравоеЗначение = ложь;
		Если ЭлементОтбораПодразделения <> Неопределено Тогда
			ЭлементОтбораПодразделения.ПравоеЗначение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		КонецЕсли;
	Иначе
		ЭлементОтбора.ПравоеЗначение = Истина;
		РежимФормированияОтчета      = "ПоЦентрамОтветственности";
		Если ЭлементОтбораПодразделения <> Неопределено Тогда
			ЭлементОтбораПодразделения.ПравоеЗначение = Справочники.Подразделения.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Описание дополнитльеных настроек отчета
//
Функция ПолучитьПараметрыИсполненияОтчета() Экспорт

	СтруктураНаcтроек = Новый Структура();
	Возврат СтруктураНаcтроек;

КонецФункции

Расшифровки = Новый СписокЗначений;

НастройкаПериода = Новый НастройкаПериода;

#КонецЕсли
